OpenNuvoton/NUC980_NonOS_BSP/ThirdParty/yaffs2/platform/fmi_nand.c
    nuvoton_nand_read_buf(mtd, chip->oob_poi, mtd->oobsize);

    // Second, copy OOB data to SMRA for page read
    memcpy ( (void*)ptr, (void*)chip->oob_poi, mtd->oobsize );

    return 0;
}



int board_nand_init(struct nand_chip *nand)
{
    struct mtd_info *mtd;

    nuvoton_nand = &g_nuvoton_nand;
    memset((void*)nuvoton_nand,0,sizeof(struct nuvoton_nand_info));
	
    if (!nuvoton_nand)
        return -1;

    mtd=&nuvoton_nand->mtd;
    nuvoton_nand->chip.controller = &nuvoton_nand->controller;

    /* initialize nand_chip data structure */
    nand->IO_ADDR_R = (void *)REG_NANDDATA;
    nand->IO_ADDR_W = (void *)REG_NANDDATA;

    /* read_buf and write_buf are default */
    /* read_byte and write_byte are default */
    /* hwcontrol always must be implemented */
    nand->cmd_ctrl = nuvoton_hwcontrol;
    nand->cmdfunc = nuvoton_nand_command;
    nand->dev_ready = nuvoton_dev_ready;
    nand->select_chip = nuvoton_nand_select_chip;

    nand->read_byte = nuvoton_nand_read_byte;
    nand->write_buf = nuvoton_nand_write_buf;
    nand->read_buf = nuvoton_nand_read_buf;
    nand->chip_delay = 50;

    nand->controller = &nuvoton_nand->controller;

    nand->ecc.mode      = NAND_ECC_HW_OOB_FIRST;
    nand->ecc.hwctl     = nuvoton_nand_enable_hwecc;
    nand->ecc.calculate = nuvoton_nand_calculate_ecc;
    nand->ecc.correct   = nuvoton_nand_correct_data;
    nand->ecc.write_page= nuvoton_nand_write_page_hwecc;
    nand->ecc.read_page = nuvoton_nand_read_page_hwecc_oob_first;
    nand->ecc.read_oob  = nuvoton_nand_read_oob_hwecc;
    nand->ecc.layout    = &nuvoton_nand_oob;
    nand->ecc.strength  = 8;
    mtd = nand_to_mtd(nand);

    mtd->priv = nand;

    /* initial NAND controller */
    outpw(REG_CLK_HCLKEN, (inpw(REG_CLK_HCLKEN) | 0x300000));

    /* Set GPC1~15 for NAND */
    outpw(REG_SYS_GPC_MFPL, (inpw(REG_SYS_GPC_MFPL) & 0xf) | 0x33333330);
    outpw(REG_SYS_GPC_MFPH, 0x33333333);

    // Enable SM_EN
    outpw(REG_FMI_CTL, NAND_EN);
    outpw(REG_NANDTMCTL, 0x20305);

    // Enable SM_CS0
    outpw(REG_NANDCTL, (inpw(REG_NANDCTL)&(~0x06000000))|0x04000000);
    outpw(REG_NANDECTL, 0x1); /* un-lock write protect */

    // NAND Reset
    outpw(REG_NANDCTL, inpw(REG_NANDCTL) | 0x1);    // software reset
    while (inpw(REG_NANDCTL) & 0x1);

    /* Detect NAND chips */
    /* first scan to find the device and get the page size */
    if (nand_scan_ident(mtd, 1, NULL)) {
        printf("NAND Flash not found !\n");
        return -1;
    }

    //Set PSize bits of SMCSR register to select NAND card page size
    switch (mtd->writesize) {
        case 2048:
            outpw(REG_NANDCTL, (inpw(REG_NANDCTL)&(~0x30000)) + 0x10000);
            nuvoton_nand->eBCHAlgo = 0; /* T8 */
            nuvoton_layout_oob_table ( &nuvoton_nand_oob, mtd->oobsize, g_i32ParityNum[0][nuvoton_nand->eBCHAlgo] );
            break;

        case 4096:
            outpw(REG_NANDCTL, (inpw(REG_NANDCTL)&(~0x30000)) + 0x20000);
            nuvoton_nand->eBCHAlgo = 0; /* T8 */
            nuvoton_layout_oob_table ( &nuvoton_nand_oob, mtd->oobsize, g_i32ParityNum[1][nuvoton_nand->eBCHAlgo] );
            break;

        case 8192:
            outpw(REG_NANDCTL, (inpw(REG_NANDCTL)&(~0x30000)) + 0x30000);
            nuvoton_nand->eBCHAlgo = 1; /* T12 */
            nuvoton_layout_oob_table ( &nuvoton_nand_oob, mtd->oobsize, g_i32ParityNum[2][nuvoton_nand->eBCHAlgo] );
            break;

        default:
            printf("NUVOTON NAND CONTROLLER IS NOT SUPPORT THE PAGE SIZE. (%d, %d)\n", mtd->writesize, mtd->oobsize );
    }

    /* check power on setting */
    if ((inpw(REG_SYS_PWRON) & 0x300) != 0x300)
    {
        switch (inpw(REG_SYS_PWRON) & 0x300)
        {
            case 0x000:
                nuvoton_nand->eBCHAlgo = 0; /* T8 */
                break;
            case 0x100:
                nuvoton_nand->eBCHAlgo = 1; /* T12 */
                break;
            case 0x200:
                nuvoton_nand->eBCHAlgo = 2; /* T24 */
                break;
            default:
                printf("wrong ECC power-on-setting\n");
        }
    }
    if ((inpw(REG_SYS_PWRON) & 0xc0) != 0xc0)
    {
        switch (inpw(REG_SYS_PWRON) & 0xc0) 
        {
            case 0x00:
                mtd->writesize = 2048;
                outpw(REG_NANDCTL, (inpw(REG_NANDCTL)&(~0x30000)) + 0x10000);
                mtd->oobsize = g_i32ParityNum[0][nuvoton_nand->eBCHAlgo] + 8;
                nuvoton_layout_oob_table( &nuvoton_nand_oob, mtd->oobsize, g_i32ParityNum[0][nuvoton_nand->eBCHAlgo] );
                break;

            case 0x40:
                mtd->writesize = 4096;
                outpw(REG_NANDCTL, (inpw(REG_NANDCTL)&(~0x30000)) + 0x20000);
                mtd->oobsize = g_i32ParityNum[1][nuvoton_nand->eBCHAlgo] + 8;
                nuvoton_layout_oob_table ( &nuvoton_nand_oob, mtd->oobsize, g_i32ParityNum[1][nuvoton_nand->eBCHAlgo] );
                break;

            case 0x80:
                mtd->writesize = 8192;
                outpw(REG_NANDCTL, (inpw(REG_NANDCTL)&(~0x30000)) + 0x30000);
                mtd->oobsize = g_i32ParityNum[2][nuvoton_nand->eBCHAlgo] + 8;
                nuvoton_layout_oob_table ( &nuvoton_nand_oob, mtd->oobsize, g_i32ParityNum[2][nuvoton_nand->eBCHAlgo] );
                break;

            default:
                printf("wrong NAND page power-on-setting\n");
        }
    }
    nuvoton_nand->m_i32SMRASize  = mtd->oobsize;
    nand->ecc.bytes = nuvoton_nand_oob.eccbytes;
    nand->ecc.size  = mtd->writesize;

    nand->options = 0;
    nand->bbt_options = (NAND_BBT_USE_FLASH | NAND_BBT_NO_OOB);

    // Redundant area size
    outpw(REG_NANDRACTL, nuvoton_nand->m_i32SMRASize);

    // Protect redundant 3 bytes
    // because we need to implement write_oob function to partial data to oob available area.
    // Please note we skip 4 bytes
    outpw(REG_NANDCTL, inpw(REG_NANDCTL) | 0x100);

    // To read/write the ECC parity codes automatically from/to NAND Flash after data area field written.
    outpw(REG_NANDCTL, inpw(REG_NANDCTL) | 0x10);
    // Set BCH algorithm
    outpw(REG_NANDCTL, (inpw(REG_NANDCTL) & (~0x007C0000)) | g_i32BCHAlgoIdx[nuvoton_nand->eBCHAlgo]);
    // Enable H/W ECC, ECC parity check enable bit during read page
    outpw(REG_NANDCTL, inpw(REG_NANDCTL) | 0x00800080);

    return 0;
}

/// @endcond HIDDEN_SYMBOLS


/*@}*/ /* end of group NAND_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NAND_Driver */

/*@}*/ /* end of group Standard_Driver */

/*** (C) COPYRIGHT 2018 Nuvoton Technology Corp. ***/



